const subjects = [{
        "code": 13,
        "id": 1,
        "title": "היסטוריה"
    },
    {
        "code": 17,
        "id": 2,
        "title": "מקרא"
    },
    {
        "code": 20,
        "id": 3,
        "title": "מחשבים"
    },
    {
        "code": 22,
        "id": 4,
        "title": "יהדות"
    },
    {
        "code": 24,
        "id": 5,
        "title": "מחשבת ישראל"
    },
    {
        "code": 28,
        "id": 6,
        "title": "תורה שבעל-פה"
    },
    {
        "code": 38,
        "id": 7,
        "title": "ספרות ילדים"
    },
    {
        "code": 42,
        "id": 8,
        "title": "גיאוגרפיה - אדם וסביבה"
    },
    {
        "code": 43,
        "id": 9,
        "title": "כישורי חיים"
    },
    {
        "code": 45,
        "id": 10,
        "title": "לימודי ארץ ישראל"
    },
    {
        "code": 48,
        "id": 11,
        "title": "מדעי החברה"
    },
    {
        "code": 49,
        "id": 12,
        "title": "תיירות"
    },
    {
        "code": 52,
        "id": 13,
        "title": "מורשת ודת האיסלאם"
    },
    {
        "code": 55,
        "id": 14,
        "title": "מורשת דרוזית"
    },
    {
        "code": 59,
        "id": 15,
        "title": "לימודי דת ותרבות האיסלם"
    },
    {
        "code": 62,
        "id": 16,
        "title": "אנגלית"
    },
    {
        "code": 72,
        "id": 17,
        "title": "חינוך מיוחד"
    },
    {
        "code": 73,
        "id": 18,
        "title": "חינוך מיוחד-שילוב"
    },
    {
        "code": 81,
        "id": 19,
        "title": "ביולוגיה"
    },
    {
        "code": 85,
        "id": 20,
        "title": "כימיה"
    },
    {
        "code": 87,
        "id": 21,
        "title": "מתמטיקה"
    },
    {
        "code": 89,
        "id": 22,
        "title": "פיסיקה"
    },
    {
        "code": 95,
        "id": 23,
        "title": "מדעי המחשב"
    },
    {
        "code": 102,
        "id": 24,
        "title": "חינוך גופני"
    },
    {
        "code": 104,
        "id": 25,
        "title": "חקלאות"
    },
    {
        "code": 105,
        "id": 26,
        "title": "כלכלת בית"
    },
    {
        "code": 107,
        "id": 27,
        "title": "מוסיקה"
    },
    {
        "code": 109,
        "id": 28,
        "title": "ריתמוסיקה"
    },
    {
        "code": 114,
        "id": 29,
        "title": "צילום"
    },
    {
        "code": 119,
        "id": 30,
        "title": "אומנויות (אמנות ומלאכה)"
    },
    {
        "code": 130,
        "id": 31,
        "title": "אופנה"
    },
    {
        "code": 131,
        "id": 32,
        "title": "עיצוב אפנה ותלבושות"
    },
    {
        "code": 137,
        "id": 33,
        "title": "מערכות חשמל"
    },
    {
        "code": 140,
        "id": 34,
        "title": "טכנולוגיה מוכללת"
    },
    {
        "code": 146,
        "id": 35,
        "title": "ניתוח התנהגות"
    },
    {
        "code": 162,
        "id": 36,
        "title": "חשבונאות"
    },
    {
        "code": 173,
        "id": 37,
        "title": "מורשת ודת נוצרית"
    },
    {
        "code": 178,
        "id": 38,
        "title": "של\"ח\""
    },
    {
        "code": 201,
        "id": 39,
        "title": "מחול"
    },
    {
        "code": 203,
        "id": 40,
        "title": "אקטואליה"
    },
    {
        "code": 213,
        "id": 41,
        "title": "חינוך"
    },
    {
        "code": 214,
        "id": 42,
        "title": "עיצוב"
    },
    {
        "code": 225,
        "id": 43,
        "title": "אגדות חז\"ל"
    },
    {
        "code": 250,
        "id": 44,
        "title": "פילוסופיה"
    },
    {
        "code": 297,
        "id": 45,
        "title": "אמנות הקולנוע"
    },
    {
        "code": 300,
        "id": 46,
        "title": "תרבות ומורשת"
    },
    {
        "code": 303,
        "id": 47,
        "title": "תרבות יהודית-ישראלית"
    },
    {
        "code": 314,
        "id": 48,
        "title": "מכניקה הנדסית"
    },
    {
        "code": 315,
        "id": 49,
        "title": "מדעים"
    },
    {
        "code": 335,
        "id": 50,
        "title": "מינהל וכלכלה"
    },
    {
        "code": 342,
        "id": 51,
        "title": "ערבית - לשון והבעה"
    },
    {
        "code": 343,
        "id": 52,
        "title": "היסטוריה - בי\"ס ערבי\""
    },
    {
        "code": 344,
        "id": 53,
        "title": "אזרחות - בי\"ס ערבי\""
    },
    {
        "code": 346,
        "id": 54,
        "title": "עברית בחינוך הערבי"
    },
    {
        "code": 347,
        "id": 55,
        "title": "ערבית- ח.דרוזי-לשון והבעה"
    },
    {
        "code": 348,
        "id": 56,
        "title": "עברית בחינוך הדרוזי"
    },
    {
        "code": 350,
        "id": 57,
        "title": "ערבית לחינוך העברי"
    },
    {
        "code": 354,
        "id": 58,
        "title": "אופטיקה ישומית"
    },
    {
        "code": 355,
        "id": 59,
        "title": "אזרחות - בי\"ס דרוזי"
    },
    {
        "code": 356,
        "id": 60,
        "title": "בולגרית"
    },
    {
        "code": 366,
        "id": 61,
        "title": "היסטוריה - בי\"ס דרוזי"
    },
    {
        "code": 369,
        "id": 62,
        "title": "טכנולוגית בנייה"
    },
    {
        "code": 372,
        "id": 63,
        "title": "לאדינו"
    },
    {
        "code": 373,
        "id": 64,
        "title": "לטינית/רומית"
    },
    {
        "code": 376,
        "id": 65,
        "title": "מחשבת ישראל - בי\"ס דתי"
    },
    {
        "code": 377,
        "id": 66,
        "title": "מחשבת ישראל - בי\"ס כללי"
    },
    {
        "code": 378,
        "id": 67,
        "title": "מחשוב ובקרה"
    },
    {
        "code": 379,
        "id": 68,
        "title": "ניהול תיירות"
    },
    {
        "code": 381,
        "id": 69,
        "title": "מערכות אלקטרוניות"
    },
    {
        "code": 382,
        "id": 70,
        "title": "מערכות ביוטכנולוגיה"
    },
    {
        "code": 386,
        "id": 71,
        "title": "מערכות הספק פיקוד ובקרה"
    },
    {
        "code": 387,
        "id": 72,
        "title": "מערכות תיב\"מ\""
    },
    {
        "code": 389,
        "id": 73,
        "title": "מערכות תעופה"
    },
    {
        "code": 390,
        "id": 74,
        "title": "אלקטרוניקה ומחשבים"
    },
    {
        "code": 396,
        "id": 75,
        "title": "מטפל באמנות - תנועה ומחול"
    },
    {
        "code": 398,
        "id": 76,
        "title": "מטפל באמנות - מוסיקה"
    },
    {
        "code": 400,
        "id": 77,
        "title": "מרפא בעיסוק"
    },
    {
        "code": 341,
        "id": 78,
        "title": "לימודי הסביבה"
    },
    {
        "code": 405,
        "id": 79,
        "title": "מולדת חברה ואזרחות"
    },
    {
        "code": 409,
        "id": 80,
        "title": "אזרחות"
    },
    {
        "code": 413,
        "id": 81,
        "title": "ביוכימיה"
    },
    {
        "code": 419,
        "id": 82,
        "title": "פרסית"
    },
    {
        "code": 428,
        "id": 83,
        "title": "מדעי החיים וחקלאות"
    },
    {
        "code": 429,
        "id": 84,
        "title": "אמנות"
    },
    {
        "code": 432,
        "id": 85,
        "title": "מדעי המדינה"
    },
    {
        "code": 434,
        "id": 86,
        "title": "מדע וטכנולוגיה"
    },
    {
        "code": 455,
        "id": 87,
        "title": "ספרות בחינוך הממלכתי דתי"
    },
    {
        "code": 459,
        "id": 88,
        "title": "מערכות חשמל רכב"
    },
    {
        "code": 461,
        "id": 89,
        "title": "פסיכולוגיה התפתחותית"
    },
    {
        "code": 469,
        "id": 90,
        "title": "ספרות בחינוך החרדי"
    },
    {
        "code": 473,
        "id": 91,
        "title": "תולדות עם ישראל-בי\"ס דתי"
    },
    {
        "code": 474,
        "id": 92,
        "title": "תולדות עם ישראל-בי\"ס כללי"
    },
    {
        "code": 475,
        "id": 93,
        "title": "תולדות עם ישראל-בי\"ס עצמא"
    },
    {
        "code": 476,
        "id": 94,
        "title": "תורה שבעל פה ומשפט עברי"
    },
    {
        "code": 477,
        "id": 95,
        "title": "תנ\"ך - בי\"ס כללי"
    },
    {
        "code": 493,
        "id": 96,
        "title": "פיזיותרפיסט/ית"
    },
    {
        "code": 496,
        "id": 97,
        "title": "מחוננים"
    },
    {
        "code": 506,
        "id": 98,
        "title": "תאטרון"
    },
    {
        "code": 508,
        "id": 99,
        "title": "תנ\"ך - בי\"ס דתי"
    },
    {
        "code": 515,
        "id": 100,
        "title": "זהירות בדרכים"
    },
    {
        "code": 519,
        "id": 101,
        "title": "תולדות הערבים והאסלאם"
    },
    {
        "code": 520,
        "id": 102,
        "title": "כלכלה"
    },
    {
        "code": 522,
        "id": 103,
        "title": "שיווק וקידום מכירות"
    },
    {
        "code": 525,
        "id": 104,
        "title": "בקרת מכונות"
    },
    {
        "code": 527,
        "id": 105,
        "title": "תנ\"ך - בי\"ס עצמאי"
    },
    {
        "code": 528,
        "id": 106,
        "title": "אמנות בישול ואפיה מלונאית"
    },
    {
        "code": 534,
        "id": 107,
        "title": "חינוך תעבורתי"
    },
    {
        "code": 537,
        "id": 108,
        "title": "ספרות-חינוך ממלכתי, יהודי"
    },
    {
        "code": 540,
        "id": 109,
        "title": "מכטרוניקה"
    },
    {
        "code": 543,
        "id": 110,
        "title": "ניהול משאבי אנוש"
    },
    {
        "code": 544,
        "id": 111,
        "title": "ניהול התפעול"
    },
    {
        "code": 545,
        "id": 112,
        "title": "מדעי הבריאות"
    },
    {
        "code": 546,
        "id": 113,
        "title": "מערכות רפואיות"
    },
    {
        "code": 563,
        "id": 114,
        "title": "שעות ליקויי שמיעה"
    },
    {
        "code": 567,
        "id": 115,
        "title": "שעות ליקויי ראיה"
    },
    {
        "code": 577,
        "id": 116,
        "title": "ש\"ע עולים\""
    },
    {
        "code": 582,
        "id": 117,
        "title": "באורי תפילה"
    },
    {
        "code": 584,
        "id": 118,
        "title": "טעמי המקרא"
    },
    {
        "code": 585,
        "id": 119,
        "title": "משנה"
    },
    {
        "code": 586,
        "id": 120,
        "title": "תנ\"ך"
    },
    {
        "code": 587,
        "id": 121,
        "title": "פרשת השבוע"
    },
    {
        "code": 589,
        "id": 122,
        "title": "תלמוד"
    },
    {
        "code": 603,
        "id": 123,
        "title": "צרפתית"
    },
    {
        "code": 604,
        "id": 124,
        "title": "יידיש"
    },
    {
        "code": 605,
        "id": 125,
        "title": "גרמנית"
    },
    {
        "code": 607,
        "id": 126,
        "title": "רוסית"
    },
    {
        "code": 608,
        "id": 127,
        "title": "ספרדית"
    },
    {
        "code": 609,
        "id": 128,
        "title": "אמהרית"
    },
    {
        "code": 616,
        "id": 129,
        "title": "איטלקית"
    },
    {
        "code": 618,
        "id": 130,
        "title": "דינים"
    },
    {
        "code": 619,
        "id": 131,
        "title": "אבחון דידקטי (מת\"ל)"
    },
    {
        "code": 622,
        "id": 132,
        "title": "חיבור עברי"
    },
    {
        "code": 624,
        "id": 133,
        "title": "עברית (חינוך לשוני)"
    },
    {
        "code": 627,
        "id": 134,
        "title": "מדעי התזונה"
    },
    {
        "code": 645,
        "id": 135,
        "title": "הוראה כוללת"
    },
    {
        "code": 658,
        "id": 136,
        "title": "תקשורת"
    },
    {
        "code": 662,
        "id": 137,
        "title": "קלינאי תקשורת"
    },
    {
        "code": 663,
        "id": 138,
        "title": "החינוך בגיל הרך"
    },
    {
        "code": 664,
        "id": 139,
        "title": "עברית (לשון והבעה)"
    },
    {
        "code": 666,
        "id": 140,
        "title": "טלוויזיה וקולנוע"
    },
    {
        "code": 670,
        "id": 141,
        "title": "מדע כדור הארץ (גיאולוגיה)"
    },
    {
        "code": 680,
        "id": 142,
        "title": "ארכיאולוגיה"
    },
    {
        "code": 696,
        "id": 143,
        "title": "אוריינות"
    },
    {
        "code": 698,
        "id": 144,
        "title": "מחשבים ומערכות"
    },
    {
        "code": 722,
        "id": 145,
        "title": "אדריכלות"
    },
    {
        "code": 724,
        "id": 146,
        "title": "מטפל באמנות-אמנות חזותית"
    },
    {
        "code": 728,
        "id": 147,
        "title": "תקשורת (בנתיב העיוני)"
    },
    {
        "code": 731,
        "id": 148,
        "title": "מטפל באמנות - דרמה"
    },
    {
        "code": 735,
        "id": 149,
        "title": "מדע חישובי"
    },
    {
        "code": 736,
        "id": 150,
        "title": "מטפל באמנות - פסיכודרמה"
    },
    {
        "code": 743,
        "id": 151,
        "title": "מטפל באמנות - ביבליותרפיה"
    },
    {
        "code": 744,
        "id": 152,
        "title": "מדע וטכנולוגיה לכל"
    },
    {
        "code": 746,
        "id": 153,
        "title": "בקרת אקלים"
    },
    {
        "code": 747,
        "id": 154,
        "title": "ניתוח ואיתור מידע דיגיטלי"
    },
    {
        "code": 748,
        "id": 155,
        "title": "מידע וידע באינטרנט"
    },
    {
        "code": 751,
        "id": 156,
        "title": "הגנת סייבר"
    },
    {
        "code": 752,
        "id": 157,
        "title": "תחזוקת מערכות סלולריות"
    },
    {
        "code": 755,
        "id": 158,
        "title": "סוציולוגיה"
    },
    {
        "code": 774,
        "id": 159,
        "title": "חשמל ואלקטרוניקה"
    },
    {
        "code": 792,
        "id": 160,
        "title": "אומנות שימושית"
    },
    {
        "code": 796,
        "id": 161,
        "title": "מכונות"
    },
    {
        "code": 800,
        "id": 162,
        "title": "פסיכולוגיה"
    },
    {
        "code": 802,
        "id": 163,
        "title": "תרמודינמיקה טכנית"
    },
    {
        "code": 803,
        "id": 164,
        "title": "מערכות מכונאות רכב"
    },
    {
        "code": 817,
        "id": 165,
        "title": "סינית"
    },
    {
        "code": 849,
        "id": 166,
        "title": "תכנון הנדסי של מבנים"
    },
    {
        "code": 851,
        "id": 167,
        "title": "עיצוב שיער"
    },
    {
        "code": 855,
        "id": 168,
        "title": "תכנון ותכנות מערכות"
    },
    {
        "code": 858,
        "id": 169,
        "title": "אזרחות - בי\"ס עצמאי"
    },
    {
        "code": 860,
        "id": 170,
        "title": "מערכות תקשוב"
    },
    {
        "code": 861,
        "id": 171,
        "title": "תחזוקת מערכות מכניות"
    },
    {
        "code": 863,
        "id": 172,
        "title": "תשתיות מחשוב ותקשוב"
    },
    {
        "code": 865,
        "id": 173,
        "title": "עיצוב וטיפוח החן"
    },
    {
        "code": 866,
        "id": 174,
        "title": "יישומי פעילויות בחינוך"
    },
    {
        "code": 867,
        "id": 175,
        "title": "מדעי הים"
    },
    {
        "code": 868,
        "id": 176,
        "title": "ימאות וספינות"
    },
    {
        "code": 869,
        "id": 177,
        "title": "ניהול הייצור"
    },
    {
        "code": 871,
        "id": 178,
        "title": "מדעי ההנדסה"
    },
    {
        "code": 873,
        "id": 179,
        "title": "ניהול מלונאי"
    },
    {
        "code": 874,
        "id": 180,
        "title": "נביא"
    },
    {
        "code": 878,
        "id": 181,
        "title": "אוטו-טק מע' ממוחשבות ברכב"
    },
    {
        "code": 881,
        "id": 182,
        "title": "הפקות בתקשורת"
    },
    {
        "code": 896,
        "id": 183,
        "title": "ספרות בחינוך הערבי"
    },
    {
        "code": 897,
        "id": 184,
        "title": "ספרות בחינוך הדרוזי"
    },
    {
        "code": 898,
        "id": 185,
        "title": "ערבית - חינוך לשוני"
    },
    {
        "code": 899,
        "id": 186,
        "title": "ערבית-ח. דרוזי-חנוך לשוני"
    },
    {
        "code": 911,
        "id": 187,
        "title": "גננת"
    },
    {
        "code": 914,
        "id": 188,
        "title": "גננת שילוב"
    },
    {
        "code": 922,
        "id": 189,
        "title": "יועץ/יועצת"
    },
    {
        "code": 923,
        "id": 190,
        "title": "טכנולוגיה"
    },
    {
        "code": 924,
        "id": 191,
        "title": "חסידות"
    },
    {
        "code": 928,
        "id": 192,
        "title": "חוק ומשפט"
    },
    {
        "code": 964,
        "id": 193,
        "title": "צ.מ.ה - ציוד מכני הנדסי"
    },
    {
        "code": 988,
        "id": 194,
        "title": "יישומים בביוטכנולוגיה"
    },
    {
        "code": 990,
        "id": 195,
        "title": "תקשורת וחברה"
    }
];